In [1]:
import pandas as pd
import numpy as np

In [9]:
data = {"Nombre": ["Daniel", "Isabel", "Diana", "Salome", None, "Manuela", "Sofia", "Geronimo", "Gabriela", "Nelcy"],
         "Edad": [40, 39, 39, None, 5, 6, 5, 7, 13, 63],
         "Ciudad": ["Panama", "Tulua", "Buga", "Andalucia", "Sevilla", "Trujillo", "Riofrio", "Bolivar", "San pedro", np.nan ]
         }
data = pd.DataFrame(data)
data

     Nombre  Edad     Ciudad
0    Daniel  40.0     Panama
1    Isabel  39.0      Tulua
2     Diana  39.0       Buga
3    Salome   NaN  Andalucia
4      None   5.0    Sevilla
5   Manuela   6.0   Trujillo
6     Sofia   5.0    Riofrio
7  Geronimo   7.0    Bolivar
8  Gabriela  13.0  San pedro
9     Nelcy  63.0        NaN

# Limpieza de datos

### Rellenar los valores faltantes

In [10]:
df = data.fillna({"Nombre": "Desconocido",
 "Edad": data["Edad"].mean(),
 "Ciudad": "Ciudad no especificada"}, inplace=True)

In [5]:
df.head(10)

        Nombre       Edad                  Ciudad
0       Daniel  40.000000                  Panama
1       Isabel  39.000000                   Tulua
2        Diana  39.000000                    Buga
3       Salome  24.111111               Andalucia
4  Desconocido   5.000000                 Sevilla
5      Manuela   6.000000                Trujillo
6        Sofia   5.000000                 Riofrio
7     Geronimo   7.000000                 Bolivar
8     Gabriela  13.000000               San pedro
9        Nelcy  63.000000  Ciudad no especificada

https://www.youtube.com/watch?v=Id2ZC7YxQZk&list=PL5C9QKu8AsmUK_7AEP0hSmt-8vcE8gnIB&index=6